[
  {
    "company": "TSP Marine Industries",
    "project": "Vessel Inventory Management System (VIMS)",
    "period": "November 2024 – June 2025",
    "images": [
      {
        "src": "/vims/images/3.webp",
        "alt": "VIMS dashboard"
      },
      {
        "src": "/vims/images/4.webp",
        "alt": "VIMS inventory table"
      },
      {
        "src": "/vims/images/6.webp",
        "alt": "VIMS Reports"
      }
    ],
    "tech": [
      "Next.js 15",
      "TypeScript",
      "ShadCN",
      "Supabase",
      "Tailwind CSS",
      "GitHub Actions",
      "jsPDF",
      "autoTable"
    ],
    "summary": "Built and deployed a cloud-native inventory platform providing eight vessel crews real-time visibility into onboard supplies, cutting resupply planning time by 40% and reducing stock-related downtime from ~5 hrs to ~1 hr monthly.",
    "highlights": [
      "Implemented role-based access controls for sensitive operations, including PDF generation.",
      "Developed one-click requisition-slip PDF exports using jsPDF and autoTable.",
      "Engineered offline-first sync logic to cache transactions and reconcile upon reconnect.",
      "Set up CI/CD pipeline (lint → test → static export) with GitHub Actions for automated deployments."
    ]
  },
  {
    "company": "LGU Gensan – CEMCDO",
    "project": "Cooperative Profiling & Fund Utilization System",
    "period": "January 2025 – April 2025",
    "images": [
      {
        "src": "/cemcdo-app/images/landing-page.webp",
        "alt": "CEMCDO landing page"
      },
      {
        "src": "/cemcdo-app/images/admin-dashboard.webp",
        "alt": "CEMCDO admin dashboard"
      },
      {
        "src": "/photo-carousel/ojt.webp",
        "alt": "OJT at CEMCDO – System Presentation Meeting"
      },
      {
        "src": "/photo-carousel/ojt_4.webp",
        "alt": "OJT at CEMCDO – Workshop and User Testing"
      },
      {
        "src": "/photo-carousel/ojt_6.webp",
        "alt": "OOJT at CEMCDO – The Team"
      }
    ],
    "tech": [
      "Django",
      "Tailwind CSS",
      "PostgreSQL",
      "Supabase",
      "OpenPyXL",
      "Render",
      "JavaScript"
    ],
    "summary": "Delivered a full-stack portal centralising cooperative records, automating fund utilisation, and generating board-ready Excel reports—cutting manual preparation time by 50% and reducing ledger error rates below 1%.",
    "highlights": [
      "Designed fully-normalised database schema with foreign key enforcement and audit trails.",
      "Created reusable OpenPyXL helpers for multi-sheet spreadsheets with embedded charts.",
      "Developed a draft-transaction subsystem reused across four divisions via REST API.",
      "Configured GitHub Actions for linting, testing, Docker builds, and zero-downtime deployment on Render."
    ]
  },
  {
    "company": "COTSEYE Project",
    "project": "Crowd Mapping for Crown of Thorns (COTS) Monitoring",
    "period": "May 2024 – August 2024",
    "images": [
      {
        "src": "/cotseye/images/placeholder.svg",
        "alt": "COTSEYE placeholder image"
      }
    ],
    "tech": [
      "Django",
      "Python",
      "JavaScript",
      "HTML",
      "CSS",
      "Leaflet.js"
    ],
    "summary": "Developed a scalable web application to monitor Crown of Thorns outbreaks in Sarangani Bay, accelerating conservation response through real-time community reporting.",
    "highlights": [
      "Integrated Leaflet.js for geospatial mapping of sightings.",
      "Optimised backend queries for faster data retrieval and visualization.",
      "Implemented responsive UI for mobile field reporting by community members."
    ]
  },
  {
    "company": "PioneerDev.ai",
    "project": "SaaS & AI Platform Delivery",
    "period": "September 2025 – Present",
    "images": [
      {
        "src": "/static/pioneer-dev-ai/platform-overview.svg",
        "alt": "PioneerDev.ai platform overview"
      },
      {
        "src": "/static/pioneer-dev-ai/agent-pipeline.svg",
        "alt": "PioneerDev.ai agent pipeline"
      }
    ],
    "tech": [
      "Next.js 15",
      "TypeScript",
      "LangChain",
      "OpenAI GPT-4.1",
      "Supabase",
      "PostgreSQL",
      "Tailwind CSS",
      "ShadCN"
    ],
    "summary": "PioneerDev.ai builds scalable SaaS and AI-enabled applications that combine streaming LLM workflows, custom integrations, and enterprise-ready delivery for clients across law, fintech, eCommerce, and startup ecosystems. As a Full Stack Web Developer, I translate domain requirements into maintainable software that blends intuitive UX with resilient backend infrastructure.",
    "highlights": [
      "Architect, develop, and ship end-to-end features that span responsive interfaces, secure APIs, and data infrastructure.",
      "Implement streaming LLM workflows that orchestrate chained models for real-time, human-in-the-loop product experiences.",
      "Integrate authentication, payments, and domain-specific business logic into reusable SaaS foundations with strong observability and security guardrails.",
      "Champion code reviews, CI/CD automation, and production monitoring to uphold reliability while collaborating with AI engineers, designers, and stakeholders."
    ]
  }
]
